In [1]:
import pandas as pd

In [2]:
comma_sep_items = ['Thailand', 'Canada', 'Belgium,Netherlands', 'Lith,Poland,France,US,Spain', 'US']
movies = pd.DataFrame({'movies': ['m1', 'm2', 'm3', 'm4', 'm5'], 'countries': comma_sep_items})
movies

  movies                    countries
0     m1                     Thailand
1     m2                       Canada
2     m3          Belgium,Netherlands
3     m4  Lith,Poland,France,US,Spain
4     m5                           US

In [3]:
movies['countries lists'] = [x.split(",") for x in movies['countries']]

In [4]:
movies

  movies                    countries                    countries lists
0     m1                     Thailand                         [Thailand]
1     m2                       Canada                           [Canada]
2     m3          Belgium,Netherlands             [Belgium, Netherlands]
3     m4  Lith,Poland,France,US,Spain  [Lith, Poland, France, US, Spain]
4     m5                           US                               [US]

In [5]:
[x for x in movies['countries lists'] if 'US' in x]

[['Lith', 'Poland', 'France', 'US', 'Spain'], ['US']]

In [6]:
movies['is_available_in_US'] = [True if 'US' in x else False for x in movies['countries lists']]

In [7]:
movies

,movies,countries,countries lists,is_available_in_US
0,m1,Thailand,[Thailand],False
1,m2,Canada,[Canada],False
2,m3,"Belgium,Netherlands","[Belgium, Netherlands]",False
3,m4,"Lith,Poland,France,US,Spain","[Lith, Poland, France, US, Spain]",True
4,m5,US,[US],True

In [8]:
movies_in_US = movies[movies['is_available_in_US'] == True]

In [9]:
movies_in_US

,movies,countries,countries lists,is_available_in_US
3,m4,"Lith,Poland,France,US,Spain","[Lith, Poland, France, US, Spain]",True
4,m5,US,[US],True